Revit 2026 API

# SubelementIsValidSubelementReference Method

---

Checks if given Reference identifies either a valid element or subelement.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidSubelementReference(
	Document aDoc,
	Reference reference
)
```
```vb
Public Shared Function IsValidSubelementReference (
	aDoc As Document,
	reference As Reference
) As Boolean
```
```cpp
public:
static bool IsValidSubelementReference(
	Document^ aDoc,
	Reference^ reference
)
```
```fsharp
static member IsValidSubelementReference :
        aDoc : Document *
        reference : Reference -> bool
```

#### Parameters

aDoc Document
     The document.
reference Reference
     The reference that identifies an element or subelement.

#### Return Value

Boolean True if %reference% identifies a valid element or subelement, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

A reference to an element or subelement in a linked document is acceptable.

#### Reference

Subelement Class

Autodesk.Revit.DB Namespace